app/views/picnics/_tab-area.html.erb

  <div class="row">
    <% Item.where(area:area).each do |i| %>
---
SELECT "items".* FROM "items" WHERE "items"."area" = ?  [["area", 0]]