app/views/picnics/_tab-all.html.erb

SELECT "items".* FROM "items"
---
  <div class="row">
    <% Item.all.each do |i| %>