app/views/diaries/index.html.erb

SELECT "diaries".* FROM "diaries"
---
<div class="row" style="padding:0 20px;">
    <% Diary.all.each do |d| %>