app/controllers/items_controller.rb

  def show
    @reviews = Review.where(item_id: params[:id]).order(created_at: :desc)
    @recommendations = Item.where(category: @item.category).where.not(id: @item.id).order("random()").limit(3)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."item_id" = ? ORDER BY "reviews"."created_at" ASC LIMIT ?  [["item_id", 14], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."category" = ? AND "items"."id" != ? ORDER BY random() LIMIT ?  [["category", 0], ["id", 14], ["LIMIT", 3]]

  def toggle
    if user_item = current_user.user_items.find_by(item: @item)
      user_item.destroy
    else
      current_user.user_items.create(item: @item)
---
SELECT  "user_items".* FROM "user_items" WHERE "user_items"."user_id" = ? AND "user_items"."item_id" = ? LIMIT ?  [["user_id", 1], ["item_id", 26], ["LIMIT", 1]]
DELETE FROM "user_items" WHERE "user_items"."id" = ?  [["id", 4]]
INSERT INTO "user_items" ("user_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["item_id", 26], ["created_at", "2019-08-04 16:50:00.258579"], ["updated_at", "2019-08-04 16:50:00.258579"]]