app/controllers/picnics_controller.rb

SELECT "items".* FROM "items"
---
  def index
    if params[:search]
      @search_result = Item.where('title || content LIKE ?', "%#{params[:search]}%")
      byebug
    else
      @search_result = Item.all