app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("content", "user_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "asd"], ["user_id", 1], ["item_id", 14], ["created_at", "2019-08-04 16:14:47.629756"], ["updated_at", "2019-08-04 16:14:47.629756"]]
---
  def create
    @review = Review.new(review_params)
    @review.user = current_user
    @review.item = @item
    @review.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def set_item
    @item = Item.find(params[:item_id])