app/models/user.rb

SELECT  "user_items".* FROM "user_items" WHERE "user_items"."user_id" = ? AND "user_items"."item_id" = ? LIMIT ?  [["user_id", 1], ["item_id", 16], ["LIMIT", 1]]
---
  def like?(item)
    UserItem.find_by(user: self, item: item).present?