app/views/reviews/_review.html.erb

INSERT INTO "reviews" ("content", "user_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "asd"], ["user_id", 1], ["item_id", 14], ["created_at", "2019-08-04 16:37:33.003688"], ["updated_at", "2019-08-04 16:37:33.003688"]]
---
        <img src="https://image.ibb.co/jw55Ex/def_face.jpg" class="img img-rounded img-fluid"/>
        <p class="text-secondary text-center" style="margin-top: 10px; margin-bottom: 0"><%= review.created_at.strftime('%F %T') %></p>